In [59]:
install.packages("dplyr")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [60]:
library(dplyr)

In [61]:
library(tidyverse)

In [62]:
glimpse(mtcars)

Rows: 32
Columns: 11
$ mpg  <dbl> 21.0, 21.0, 22.8, 21.4, 18.7, 18.1, 14.3, 24.4, 22.8, 19.2, 17.8,…
$ cyl  <dbl> 6, 6, 4, 6, 8, 6, 8, 4, 4, 6, 6, 8, 8, 8, 8, 8, 8, 4, 4, 4, 4, 8,…
$ disp <dbl> 160.0, 160.0, 108.0, 258.0, 360.0, 225.0, 360.0, 146.7, 140.8, 16…
$ hp   <dbl> 110, 110, 93, 110, 175, 105, 245, 62, 95, 123, 123, 180, 180, 180…
$ drat <dbl> 3.90, 3.90, 3.85, 3.08, 3.15, 2.76, 3.21, 3.69, 3.92, 3.92, 3.92,…
$ wt   <dbl> 2.620, 2.875, 2.320, 3.215, 3.440, 3.460, 3.570, 3.190, 3.150, 3.…
$ qsec <dbl> 16.46, 17.02, 18.61, 19.44, 17.02, 20.22, 15.84, 20.00, 22.90, 18…
$ vs   <dbl> 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,…
$ am   <dbl> 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0,…
$ gear <dbl> 4, 4, 4, 3, 3, 3, 3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3, 3,…
$ carb <dbl> 4, 4, 1, 1, 2, 1, 4, 2, 2, 4, 4, 3, 3, 3, 4, 4, 4, 1, 2, 1, 1, 2,…

In [63]:
str(mtcars)

'data.frame':	32 obs. of  11 variables:
 $ mpg : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
 $ cyl : num  6 6 4 6 8 6 8 4 4 6 ...
 $ disp: num  160 160 108 258 360 ...
 $ hp  : num  110 110 93 110 175 105 245 62 95 123 ...
 $ drat: num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
 $ wt  : num  2.62 2.88 2.32 3.21 3.44 ...
 $ qsec: num  16.5 17 18.6 19.4 17 ...
 $ vs  : num  0 0 1 1 0 1 0 1 1 1 ...
 $ am  : num  1 1 1 0 0 0 0 0 0 0 ...
 $ gear: num  4 4 4 3 3 3 3 4 4 4 ...
 $ carb: num  4 4 1 1 2 1 4 2 2 4 ...

# **dplyr: Pipes**

 The pipe operator %>% is a special symbol available after you load the dplyr package that lets you use the result of one function as the input to another function that comes after the pipe. Pipes essentially let you chain several functions together, creating a flow or pipeline of operations.

In [64]:
predictions <- c(4,5,6,3,4,6,8,3,5,7)
actual <- c(6,4,6,8,6,4,5,6,8,6,4)

In [65]:
mean((actual-predictions)^2) %>% sqrt()

Warning message in actual - predictions:
“longer object length is not a multiple of shorter object length”

[1] 2.44949

In [66]:
sqrt(mean((actual-predictions)^2))

Warning message in actual - predictions:
“longer object length is not a multiple of shorter object length”

[1] 2.44949

In [67]:
data <- mtcars
data %>% rownames_to_column("model") %>%
          filter(cyl==4)  %>%
          mutate(hp_per_1000=hp/wt) %>%
          select(model,mpg,hp,wt,hp_per_1000) %>%
          arrange(desc(hp_per_1000))

   model          mpg  hp  wt    hp_per_1000
1  Lotus Europa   30.4 113 1.513 74.68605
2  Porsche 914-2  26.0  91 2.140 42.52336
3  Datsun 710     22.8  93 2.320 40.08621
4  Toyota Corona  21.5  97 2.465 39.35091
5  Volvo 142E     21.4 109 2.780 39.20863
6  Toyota Corolla 33.9  65 1.835 35.42234
7  Fiat X1-9      27.3  66 1.935 34.10853
8  Honda Civic    30.4  52 1.615 32.19814
9  Merc 230       22.8  95 3.150 30.15873
10 Fiat 128       32.4  66 2.200 30.00000
11 Merc 240D      24.4  62 3.190 19.43574

In [68]:
arrange(select(mutate(filter(rownames_to_column(data, "model"), cyl == 4), hp_per_1000 = hp/wt), model,mpg,hp,wt,hp_per_1000), desc(hp_per_1000))

   model          mpg  hp  wt    hp_per_1000
1  Lotus Europa   30.4 113 1.513 74.68605
2  Porsche 914-2  26.0  91 2.140 42.52336
3  Datsun 710     22.8  93 2.320 40.08621
4  Toyota Corona  21.5  97 2.465 39.35091
5  Volvo 142E     21.4 109 2.780 39.20863
6  Toyota Corolla 33.9  65 1.835 35.42234
7  Fiat X1-9      27.3  66 1.935 34.10853
8  Honda Civic    30.4  52 1.615 32.19814
9  Merc 230       22.8  95 3.150 30.15873
10 Fiat 128       32.4  66 2.200 30.00000
11 Merc 240D      24.4  62 3.190 19.43574

# **dplyr : Filter**

The filter() function in dplyr lets you extract rows from a data frame based on logical criteria.

In [69]:
data %>% filter(mpg>20)

               mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Mazda RX4      21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag  21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
Datsun 710     22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive 21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
Merc 240D      24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2
Merc 230       22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
Fiat 128       32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
Honda Civic    30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
Toyota Corolla 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1
Toyota Corona  21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1
Fiat X1-9      27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
Porsche 914-2  26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2
Lotus Europa   30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
Volvo 142E     21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2

In [70]:
data %>% filter(mpg>20, cyl==6)

               mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4      21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag  21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Hornet 4 Drive 21.4 6   258  110 3.08 3.215 19.44 1  0  3    1

In [71]:
#without filter
data[data$mpg > 20 & data$cyl ==6, ]

               mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4      21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag  21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Hornet 4 Drive 21.4 6   258  110 3.08 3.215 19.44 1  0  3    1

In [72]:
#special subsetting functions
#top_n
data %>% top_n(5,mpg)

               mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Fiat 128       32.4 4   78.7  66 4.08 2.200 19.47 1  1  4    1
Honda Civic    30.4 4   75.7  52 4.93 1.615 18.52 1  1  4    2
Toyota Corolla 33.9 4   71.1  65 4.22 1.835 19.90 1  1  4    1
Fiat X1-9      27.3 4   79.0  66 4.08 1.935 18.90 1  1  4    1
Lotus Europa   30.4 4   95.1 113 3.77 1.513 16.90 1  1  5    2

In [73]:
#slice() gets row by index position
data %>% slice(1,3,5)

                  mpg  cyl disp hp  drat wt   qsec  vs am gear carb
Mazda RX4         21.0 6   160  110 3.90 2.62 16.46 0  1  4    4
Datsun 710        22.8 4   108   93 3.85 2.32 18.61 1  1  4    1
Hornet Sportabout 18.7 8   360  175 3.15 3.44 17.02 0  0  3    2

In [74]:
#sample_rac() selects a random sample of rows
data %>% sample_frac(0.2, replace= TRUE)

                 mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Dodge Challenger 15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2
Merc 230         22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
Pontiac Firebird 19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2
Volvo 142E       21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2
Fiat X1-9        27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
Datsun 710       22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1

In [75]:
# distinct() drops duplicate rows (similar to unique() in base R)
data <- rbind(mtcars, mtcars)
nrow(data)
data %>% distinct() %>% nrow()

[1] 64

[1] 32

# **dplyr:Select**

The select() function lets you extract columns of interest by name or by using functions to match column names.

In [76]:
data <- read.csv("/content/train.csv", stringsAsFactors = FALSE)

In [77]:
glimpse(data)

Rows: 891
Columns: 12
$ PassengerId <int> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17,…
$ Survived    <int> 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1…
$ Pclass      <int> 3, 1, 3, 1, 3, 3, 1, 3, 3, 2, 3, 1, 3, 3, 3, 2, 3, 2, 3, 3…
$ Name        <chr> "Braund, Mr. Owen Harris", "Cumings, Mrs. John Bradley (Fl…
$ Sex         <chr> "male", "female", "female", "female", "male", "male", "mal…
$ Age         <dbl> 22, 38, 26, 35, 35, NA, 54, 2, 27, 14, 4, 58, 20, 39, 14, …
$ SibSp       <int> 1, 1, 0, 1, 0, 0, 0, 3, 0, 1, 1, 0, 0, 1, 0, 0, 4, 0, 1, 0…
$ Parch       <int> 0, 0, 0, 0, 0, 0, 0, 1, 2, 0, 1, 0, 0, 5, 0, 0, 1, 0, 0, 0…
$ Ticket      <chr> "A/5 21171", "PC 17599", "STON/O2. 3101282", "113803", "37…
$ Fare        <dbl> 7.2500, 71.2833, 7.9250, 53.1000, 8.0500, 8.4583, 51.8625,…
$ Cabin       <chr> "", "C85", "", "C123", "", "", "E46", "", "", "", "G6", "C…
$ Embarked    <chr> "S", "C", "S", "S", "S", "Q", "S", "S", "S", "C", "S", "S"…

In [78]:
data %>% select(Name, Age, Sex, Survived) %>% head()

  Name                                                Age Sex    Survived
1 Braund, Mr. Owen Harris                             22  male   0
2 Cumings, Mrs. John Bradley (Florence Briggs Thayer) 38  female 1
3 Heikkinen, Miss. Laina                              26  female 1
4 Futrelle, Mrs. Jacques Heath (Lily May Peel)        35  female 1
5 Allen, Mr. William Henry                            35  male   0
6 Moran, Mr. James                                    NA  male   0

In [79]:
data %>% select(-Name) %>% head()

  PassengerId Survived Pclass Sex    Age SibSp Parch Ticket           Fare
1 1           0        3      male   22  1     0     A/5 21171         7.2500
2 2           1        1      female 38  1     0     PC 17599         71.2833
3 3           1        3      female 26  0     0     STON/O2. 3101282  7.9250
4 4           1        1      female 35  1     0     113803           53.1000
5 5           0        3      male   35  0     0     373450            8.0500
6 6           0        3      male   NA  0     0     330877            8.4583
  Cabin Embarked
1       S
2 C85   C
3       S
4 C123  S
5       S
6       Q

In [80]:
data %>% select("Sex":"Ticket") %>% head()

  Sex    Age SibSp Parch Ticket
1 male   22  1     0     A/5 21171
2 female 38  1     0     PC 17599
3 female 26  0     0     STON/O2. 3101282
4 female 35  1     0     113803
5 male   35  0     0     373450
6 male   NA  0     0     330877

In [81]:
data %>% select(starts_with("S")) %>% head()

  Survived Sex    SibSp
1 0        male   1
2 1        female 1
3 1        female 0
4 1        female 1
5 0        male   0
6 0        male   0

In [82]:
data %>% select(ends_with("e")) %>% head()

  Name                                                Age Fare
1 Braund, Mr. Owen Harris                             22   7.2500
2 Cumings, Mrs. John Bradley (Florence Briggs Thayer) 38  71.2833
3 Heikkinen, Miss. Laina                              26   7.9250
4 Futrelle, Mrs. Jacques Heath (Lily May Peel)        35  53.1000
5 Allen, Mr. William Henry                            35   8.0500
6 Moran, Mr. James                                    NA   8.4583

In [83]:
data %>% select(matches(".e.")) %>% head()

  PassengerId Survived Sex    Ticket           Embarked
1 1           0        male   A/5 21171        S
2 2           1        female PC 17599         C
3 3           1        female STON/O2. 3101282 S
4 4           1        female 113803           S
5 5           0        male   373450           S
6 6           0        male   330877           Q

# **dplyr: Rename and Arrange**

The rename() function ind dplyr allows you to change the name of columns.

In [84]:
data <- mtcars %>% rownames_to_column("model")
head(data)

  model             mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
2 Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
3 Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
4 Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
5 Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2
6 Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1

In [85]:
subset <- data %>% rename(miles_per_gallon = mpg,
                          cylinders = cyl,
                          weight = wt) %>%
          select(model, miles_per_gallon, cylinders, weight)
subset %>% head()

  model             miles_per_gallon cylinders weight
1 Mazda RX4         21.0             6         2.620
2 Mazda RX4 Wag     21.0             6         2.875
3 Datsun 710        22.8             4         2.320
4 Hornet 4 Drive    21.4             6         3.215
5 Hornet Sportabout 18.7             8         3.440
6 Valiant           18.1             6         3.460

In [86]:
subset %>% arrange(miles_per_gallon) %>% head()

  model               miles_per_gallon cylinders weight
1 Cadillac Fleetwood  10.4             8         5.250
2 Lincoln Continental 10.4             8         5.424
3 Camaro Z28          13.3             8         3.840
4 Duster 360          14.3             8         3.570
5 Chrysler Imperial   14.7             8         5.345
6 Maserati Bora       15.0             8         3.570

In [87]:
subset %>% arrange(desc(miles_per_gallon)) %>% head()

  model          miles_per_gallon cylinders weight
1 Toyota Corolla 33.9             4         1.835
2 Fiat 128       32.4             4         2.200
3 Honda Civic    30.4             4         1.615
4 Lotus Europa   30.4             4         1.513
5 Fiat X1-9      27.3             4         1.935
6 Porsche 914-2  26.0             4         2.140

# **dplyr:Mutate**

Use mutate() to add new variables to an existing dataframe.

In [88]:
data <- mtcars %>% select(mpg, cyl, hp, wt)
head(data)

                  mpg  cyl hp  wt
Mazda RX4         21.0 6   110 2.620
Mazda RX4 Wag     21.0 6   110 2.875
Datsun 710        22.8 4    93 2.320
Hornet 4 Drive    21.4 6   110 3.215
Hornet Sportabout 18.7 8   175 3.440
Valiant           18.1 6   105 3.460

In [89]:
data %>% mutate(full_weight = wt * 1000) %>% head()

                  mpg  cyl hp  wt    full_weight
Mazda RX4         21.0 6   110 2.620 2620
Mazda RX4 Wag     21.0 6   110 2.875 2875
Datsun 710        22.8 4    93 2.320 2320
Hornet 4 Drive    21.4 6   110 3.215 3215
Hornet Sportabout 18.7 8   175 3.440 3440
Valiant           18.1 6   105 3.460 3460

In [90]:
data %>% mutate(full_weight = wt * 1000,
                hp_per_cyl = hp / cyl) %>%
         head()

                  mpg  cyl hp  wt    full_weight hp_per_cyl
Mazda RX4         21.0 6   110 2.620 2620        18.33333
Mazda RX4 Wag     21.0 6   110 2.875 2875        18.33333
Datsun 710        22.8 4    93 2.320 2320        23.25000
Hornet 4 Drive    21.4 6   110 3.215 3215        18.33333
Hornet Sportabout 18.7 8   175 3.440 3440        21.87500
Valiant           18.1 6   105 3.460 3460        17.50000

In [91]:
data %>% mutate(mpg_category = if_else(mpg > 22, "high",
                               if_else(mpg > 15, "medium","low"))) %>%
         head(10)

                  mpg  cyl hp  wt    mpg_category
Mazda RX4         21.0 6   110 2.620 medium
Mazda RX4 Wag     21.0 6   110 2.875 medium
Datsun 710        22.8 4    93 2.320 high
Hornet 4 Drive    21.4 6   110 3.215 medium
Hornet Sportabout 18.7 8   175 3.440 medium
Valiant           18.1 6   105 3.460 medium
Duster 360        14.3 8   245 3.570 low
Merc 240D         24.4 4    62 3.190 high
Merc 230          22.8 4    95 3.150 high
Merc 280          19.2 6   123 3.440 medium

# **dplyr: Seperate & Unite**

In [92]:
data <- data.frame(dates = c("Jan/2/2018",
                             "Feb/24/2019",
                             "Jan/14/2015",
                             "Mar/4/2016",
                             "Nov/23/2017",
                             "Jul/1/2016"))

head(data)

  dates
1 Jan/2/2018
2 Feb/24/2019
3 Jan/14/2015
4 Mar/4/2016
5 Nov/23/2017
6 Jul/1/2016

In [93]:
data %>% separate(dates, c("Month","Day","Year"), sep="/")

  Month Day Year
1 Jan   2   2018
2 Feb   24  2019
3 Jan   14  2015
4 Mar   4   2016
5 Nov   23  2017
6 Jul   1   2016

In [94]:
#unite function
data %>% separate(dates, c("Month","Day","Year"), sep="/") %>%
         unite(new_dates, c("Month","Day","Year"), sep=",")

  new_dates
1 Jan,2,2018
2 Feb,24,2019
3 Jan,14,2015
4 Mar,4,2016
5 Nov,23,2017
6 Jul,1,2016

# **dplyr: Gather and Spread**

Use the gather() to collapse columns into key value pairs. Gather creates "long" or "tall" format data from "wide" format data.

In [95]:
wide_data <- data.frame(City = c("Minneapolis", "New York", "Chicago"),
                        Jan = c(9, 16, 16),
                        Feb = c(15, 17, 17),
                        Mar = c(15, 18, 19),
                        Apr = c(22, 20, 18),
                        May = c(20, 21, 19),
                        Jun = c(19, 22, 19),
                        July = c(18, 23, 18),
                        Aug = c(20, 22, 17),
                        Sep = c(17, 21, 18),
                        Oct = c(15, 19, 16),
                        Nov = c(13, 18, 15),
                        Dec = c(12, 16, 16))

In [96]:
wide_data

  City        Jan Feb Mar Apr May Jun July Aug Sep Oct Nov Dec
1 Minneapolis  9  15  15  22  20  19  18   20  17  15  13  12
2 New York    16  17  18  20  21  22  23   22  21  19  18  16
3 Chicago     16  17  19  18  19  19  18   17  18  16  15  16

In [97]:
long_data <- wide_data %>%
             gather(key = "Month",        # Name of new key column
                    value = "Avg_Precip", # Name of column for values
                    c(-City))             # Columns to gather

long_data

   City        Month Avg_Precip
1  Minneapolis Jan    9
2  New York    Jan   16
3  Chicago     Jan   16
4  Minneapolis Feb   15
5  New York    Feb   17
6  Chicago     Feb   17
7  Minneapolis Mar   15
8  New York    Mar   18
9  Chicago     Mar   19
10 Minneapolis Apr   22
11 New York    Apr   20
12 Chicago     Apr   18
13 Minneapolis May   20
14 New York    May   21
15 Chicago     May   19
16 Minneapolis Jun   19
17 New York    Jun   22
18 Chicago     Jun   19
19 Minneapolis July  18
20 New York    July  23
21 Chicago     July  18
22 Minneapolis Aug   20
23 New York    Aug   22
24 Chicago     Aug   17
25 Minneapolis Sep   17
26 New York    Sep   21
27 Chicago     Sep   18
28 Minneapolis Oct   15
29 New York    Oct   19
30 Chicago     Oct   16
31 Minneapolis Nov   13
32 New York    Nov   18
33 Chicago     Nov   15
34 Minneapolis Dec   12
35 New York    Dec   16
36 Chicago     Dec   16

Use the spread() to separate key value pairs across multiple columns. spread() lets you turn "long" or "tall" format data into "wide" data.

In [98]:
wide_again <- long_data %>%
              spread(key = "Month",        # Name of new key column
                     value = "Avg_Precip") # Name of column for values


wide_again

  City        Apr Aug Dec Feb Jan July Jun Mar May Nov Oct Sep
1 Chicago     18  17  16  17  16  18   19  19  19  15  16  18
2 Minneapolis 22  20  12  15   9  18   19  15  20  13  15  17
3 New York    20  22  16  17  16  23   22  18  21  18  19  21

# **dplyr:Summarize**

The summarize() function lets you generate summary statistics for variables in a data set. In general, it lets you apply whatever function you want to a column as long as it returns a single value.

In [99]:
# Use summarize() to find the average mpg
data <- mtcars %>% rownames_to_column("model")

data %>% summarize(avg_mpg = mean(mpg))

  avg_mpg
1 20.09062

In [101]:
data %>% summarize(avg_mpg = mean(mpg),
                   median_mpg = median(mpg),
                   avg_weight = mean(wt),
                   median_weight = median(wt))

  avg_mpg  median_mpg avg_weight median_weight
1 20.09062 19.2       3.21725    3.325

In [102]:
data %>% summarize_all(list(mean), na.rm = TRUE)

Warning message:
“There was 1 warning in `summarise()`.
ℹ In argument: `model = (function (x, ...) ...`.
Caused by warning in `mean.default()`:
! argument is not numeric or logical: returning NA”

  model mpg      cyl    disp     hp       drat     wt      qsec     vs
1 NA    20.09062 6.1875 230.7219 146.6875 3.596563 3.21725 17.84875 0.4375
  am      gear   carb
1 0.40625 3.6875 2.8125

dplyr provides some useful functions for summarizing data include "first" and "last" to get the first and last values of a vector, "n" to get a count of the number of values and "n_distinct" to get a count of the distinct values.

In [103]:
# Extract the number of distinct cylindar configurations
data %>% summarize(unique_cyl = n_distinct(cyl))

  unique_cyl
1 3

# **Dplyr: Grouping**

dplyr functions like mutate and summarize operate on entire columns of data frames by default. Grouping allows you to operations within a specified subset of the data. This is useful for summarizing data based on the value of a categorical variable. For example, with the Titanic disaster training set, we can group passengers by class to generate summary statistics within each passenger class instead of all passengers as a whole.

In [106]:
data <- read.csv("/content/train.csv",
                 stringsAsFactors = FALSE) %>% select(Name, Sex, Pclass, Survived, Fare)

data %>% group_by(Pclass) %>%
         summarize(avg_fare = mean(Fare))

  Pclass avg_fare
1 1      84.15469
2 2      20.66218
3 3      13.67555

In [107]:
# You can also use groups to create new variables with mutate

data %>% group_by(Pclass) %>%
         mutate(Within_Class_Fare_Diff = Fare - mean(Fare)) %>%
         head(10)

   Name                                                Sex    Pclass Survived
1  Braund, Mr. Owen Harris                             male   3      0
2  Cumings, Mrs. John Bradley (Florence Briggs Thayer) female 1      1
3  Heikkinen, Miss. Laina                              female 3      1
4  Futrelle, Mrs. Jacques Heath (Lily May Peel)        female 1      1
5  Allen, Mr. William Henry                            male   3      0
6  Moran, Mr. James                                    male   3      0
7  McCarthy, Mr. Timothy J                             male   1      0
8  Palsson, Master. Gosta Leonard                      male   3      0
9  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   female 3      1
10 Nasser, Mrs. Nicholas (Adele Achem)                 female 2      1
   Fare    Within_Class_Fare_Diff
1   7.2500  -6.425550
2  71.2833 -12.871387
3   7.9250  -5.750550
4  53.1000 -31.054687
5   8.0500  -5.625550
6   8.4583  -5.217250
7  51.8625 -32.292187
8  21.0750   7.399450
9  11.1333  -2.542250
10 30.0708   9.408617

After grouping, the ungroup() function lets you go back to working with a normal data frame. This allows you to go back and operate on entire columns all at once or switch to a different grouping. It is also possible to group by multiple columns at the same time. Let's look at a use case for using ungroup() and grouping by multiple columns at the same time:

In [108]:
data %>% group_by(Pclass) %>%
         mutate(Within_Class_Fare_Diff = Fare - mean(Fare)) %>%
         ungroup() %>%
         group_by(Pclass, Survived) %>%
         summarize(mean(Within_Class_Fare_Diff))

`summarise()` has grouped output by 'Pclass'. You can override using the
`.groups` argument.

  Pclass Survived mean(Within_Class_Fare_Diff)
1 1      0        -19.470680000
2 1      1         11.453341176
3 2      0         -1.249855317
4 2      1          1.393516848
5 3      0         -0.006185855
6 3      1          0.019337293

# **Dplyr:Joins**

If you have data in multiple tables, you may need to combine them together before you can start using the other dplyr functions. Combining two data sets together based on a shared column (key column) is known as joining or merging data. dplyr offers several functions for common data joins. We'll some common joins on a fake data set I've prepared for this lesson.

Note that if have data sets where all the columns are the same, but you just have different records and you want to concatenate them together, you don't need a join. Use the built in function rbind() or the dplyr function bind_rows() to paste the tables together. (Similarly, you can append new columns with cbind() or the dplyr function bind_cols())

In [109]:
table1 <- data.frame(P_ID = c(1:8),
                     gender = c("male", "male", "female","female",
                                "female", "male", "female", "male"),
                     height = c(71,73,64,64,66,69,62,72),
                     weight = c(175,225,130,125,165,160,115,250))

table2 <- data.frame(P_ID = c(1, 2, 4, 5, 7, 8, 9, 10),
                     sex = c("male", "male", "female","female",
                                "female", "male", "male", "female"),
                     visits = c(1,2,4,12,2,2,1,1),
                     checkup = c(1,1,1,1,1,1,0,0),
                     follow_up = c(0,0,1,2,0,0,0,0),
                     illness = c(0,0,2,7,1,1,0,0),
                     surgery = c(0,0,0,2,0,0,0,0),
                     ER = c( 0,1,0,0,0,0,1,1))

table1
table2

  P_ID gender height weight
1 1    male   71     175
2 2    male   73     225
3 3    female 64     130
4 4    female 64     125
5 5    female 66     165
6 6    male   69     160
7 7    female 62     115
8 8    male   72     250

  P_ID sex    visits checkup follow_up illness surgery ER
1  1   male    1     1       0         0       0       0
2  2   male    2     1       0         0       0       1
3  4   female  4     1       1         2       0       0
4  5   female 12     1       2         7       2       0
5  7   female  2     1       0         1       0       0
6  8   male    2     1       0         1       0       0
7  9   male    1     0       0         0       0       1
8 10   female  1     0       0         0       0       1

In [110]:
# Inner join
table1 %>% inner_join(table2, by="P_ID")

  P_ID gender height weight sex    visits checkup follow_up illness surgery ER
1 1    male   71     175    male    1     1       0         0       0       0
2 2    male   73     225    male    2     1       0         0       0       1
3 4    female 64     125    female  4     1       1         2       0       0
4 5    female 66     165    female 12     1       2         7       2       0
5 7    female 62     115    female  2     1       0         1       0       0
6 8    male   72     250    male    2     1       0         1       0       0

In [111]:
# Left join
table1 %>% left_join(table2, by="P_ID")

  P_ID gender height weight sex    visits checkup follow_up illness surgery ER
1 1    male   71     175    male    1      1       0         0       0       0
2 2    male   73     225    male    2      1       0         0       0       1
3 3    female 64     130    NA     NA     NA      NA        NA      NA      NA
4 4    female 64     125    female  4      1       1         2       0       0
5 5    female 66     165    female 12      1       2         7       2       0
6 6    male   69     160    NA     NA     NA      NA        NA      NA      NA
7 7    female 62     115    female  2      1       0         1       0       0
8 8    male   72     250    male    2      1       0         1       0       0

In [112]:
# Outer (full) join
table1 %>% full_join(table2, by="P_ID")

   P_ID gender height weight sex    visits checkup follow_up illness surgery ER
1   1   male   71     175    male    1      1       0         0       0       0
2   2   male   73     225    male    2      1       0         0       0       1
3   3   female 64     130    NA     NA     NA      NA        NA      NA      NA
4   4   female 64     125    female  4      1       1         2       0       0
5   5   female 66     165    female 12      1       2         7       2       0
6   6   male   69     160    NA     NA     NA      NA        NA      NA      NA
7   7   female 62     115    female  2      1       0         1       0       0
8   8   male   72     250    male    2      1       0         1       0       0
9   9   NA     NA      NA    male    1      0       0         0       0       1
10 10   NA     NA      NA    female  1      0       0         0       0       1

In [113]:
# You can specify multiple key columns to join upon
table1 %>% full_join(table2, by=c("P_ID", "gender" = "sex"))

   P_ID gender height weight visits checkup follow_up illness surgery ER
1   1   male   71     175     1      1       0         0       0       0
2   2   male   73     225     2      1       0         0       0       1
3   3   female 64     130    NA     NA      NA        NA      NA      NA
4   4   female 64     125     4      1       1         2       0       0
5   5   female 66     165    12      1       2         7       2       0
6   6   male   69     160    NA     NA      NA        NA      NA      NA
7   7   female 62     115     2      1       0         1       0       0
8   8   male   72     250     2      1       0         1       0       0
9   9   male   NA      NA     1      0       0         0       0       1
10 10   female NA      NA     1      0       0         0       0       1

Identify records in table1 that do not have a match in table2 with anti_join()

In [114]:
table1 %>% anti_join(table2, by="P_ID")

  P_ID gender height weight
1 3    female 64     130
2 6    male   69     160

Identify records in table1 that do not have a match in table2 with anti_join()

In [115]:
table1 %>% anti_join(table2, by="P_ID")

  P_ID gender height weight
1 3    female 64     130
2 6    male   69     160